seifflifel/Synthewi/sdkconfig.defaults
# Default sdkconfig for Synthewi project

# app_main calls amy_engine_init which uses large amy_event structs (~800 bytes each)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# AMY creates tasks with ESP_TASK_PRIO_MAX which equals configMAX_PRIORITIES.
# FreeRTOS requires priority < configMAX_PRIORITIES, so bump max by 1.
CONFIG_FREERTOS_MAX_PRIORITIES=26

# Target settings (ESP32-S3)
CONFIG_IDF_TARGET="esp32s3"

# Logging
CONFIG_LOG_DEFAULT_LEVEL=3

# USB Configuration - USB OTG Device Mode for UAC audio spike
CONFIG_USB_OTG_SUPPORTED=y
CONFIG_TINYUSB_RHPORT_FS=y

# UAC descriptor and stream defaults
CONFIG_UAC_TUSB_VID=0x303A
CONFIG_UAC_TUSB_PID=0x8000
CONFIG_UAC_TUSB_MANUFACTURER="Synthewi"
CONFIG_UAC_TUSB_PRODUCT="Synthewi USB Audio"
CONFIG_UAC_TUSB_SERIAL_NUM="0001"
CONFIG_UAC_SPEAKER_CHANNEL_NUM=0
CONFIG_UAC_MIC_CHANNEL_NUM=1
CONFIG_UAC_SAMPLE_RATE=48000
CONFIG_UAC_SPK_INTERVAL_MS=10
CONFIG_UAC_MIC_INTERVAL_MS=10
CONFIG_UAC_SPK_NEW_PLAY_INTERVAL=100

# Disable Serial/JTAG for now (re-enable via menuconfig when needed for debugging)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_ROM_SERIAL_PORT_NUM=0
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=n
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=n
